Repository: heni/BackSlide
Catalog: backslide@codeisland.org/po/*.po
Languages: it

source: Up Next
it: Prossimo sfondo

source: minutes
it: minuti

source: hours
it: ore

source: Delay (%d %s)
it: Cambiamento automatico (%d %s)

source: Move selected Wallpapers up in the list.
it: Sposta lo sfondo prima

source: Move selected Wallpapers down in the list.
it: Sposta lo sfondo dopo nella lista

source: Add new Wallpapers
it: Aggiungi nuovi sfondi

source: Select the new wallpapers.
it: Seleziona il nuovo sfondo

source: Remove selected Wallpapers
it: Rimuovi lo sfondo selezionato

source: The following images where invalid (not found or not image-types) and have been removed:
it: Le seguenti immagini sono state rimosse perch√© non erano valide (file non trovati o non di tipo immagine):

source: Manage Wallpapers
it: Gestisci sfondi
